<img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /> 



<div align="right"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" />&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />&nbsp;1&nbsp;Low</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I01-I-SG</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></td>

<td align="center"><sub><img width="15" height="15" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test-1</td>

<td>Inbound "From Any allow Any service" rules from Public IPs</td>

</tr>
<tr>

<td>Auto07</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="15" height="15" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test-1</td>

<td>CIDR test</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><h3><b>tf-test-1</b></h3><div  align="right"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" />&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />&nbsp;1&nbsp;Low</div></summary>
<details>

<summary>&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" />  I01-I-SG</summary> 

### **Title:**
Inbound "From Any allow Any service" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with service Any : PASS" are usually more open than is necessary. Allowing all services allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected from internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**

```

[
	{
		"toPort": 8082,
		"fromPort": 8080,
		"ipProtocol": "-1",
		"ipRange": [
			0,
			4294967295
		]
	}
]

```

</details>
<details>

<summary>&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**

```

[
	{
		"toPort": 8082,
		"fromPort": 8080,
		"ipProtocol": "-1",
		"ipRange": [
			0,
			4294967295
		]
	}
]

```

</details>



<details>
<summary>&nbsp;&nbsp;&nbsp;<img height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/success.png" /> Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "cloudfront_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "this-is-a-test"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + include_cookies = false
          + prefix          = "logs"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "this-is-a-test"
          + origin_id           = "this-is-a-test/cloudflow"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_security_group.devsecops_test will be created
  + resource "aws_security_group" "devsecops_test" {
      + arn                    = (known after apply)
      + description            = "Display devsecops "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.20.30.0/24",
                ]
              + description      = ""
              + from_port        = 7654
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "web app"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 8082
            },
        ]
      + name                   = "devsecops_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cool_application"
        }
      + tags_all               = {
          + "Name" = "cool_application"
        }
      + vpc_id                 = "vpc-12345678"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test-1\tmp\tf-tf-test-1.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test-1\\tmp\\tf-tf-test-1.out"


```
<br>

</details> <!-- End Format Logs -->

</details><br>


*Pusher: @alonnalgo, Action: `pull_request`, Working Directory: '/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example', Workflow: 'Customer Repo CI/CD'*